Pandas DataFrame Manipulation

DataFrame manipulation in Pandas involves editing and modifying existing DataFrames. Some common DataFrame manipulation operations are:

Adding rows/columns
Removing rows/columns
Renaming rows/columns

In [51]:
import pandas as pd
data = {'Name': ['Abu Bakar', 'Bilal', 'Hassan', 'Alex', 'Mitchel Starc'],
        'Age': [25, 22, 17, 32, 35],
        'City': ['Berlin', 'Karachi', 'Hamburg', 'Berlin', 'Sydney']}
df = pd.DataFrame(data)
print(df)

            Name  Age     City
0      Abu Bakar   25   Berlin
1          Bilal   22  Karachi
2         Hassan   17  Hamburg
3           Alex   32   Berlin
4  Mitchel Starc   35   Sydney

Add a New Column to a Pandas DataFrame

In [52]:
country = ["Germany", "Pakistan", "Germany", "Germany", "Austrailia"]
df["Country"] = country

In [53]:
df

            Name  Age     City     Country
0      Abu Bakar   25   Berlin     Germany
1          Bilal   22  Karachi    Pakistan
2         Hassan   17  Hamburg     Germany
3           Alex   32   Berlin     Germany
4  Mitchel Starc   35   Sydney  Austrailia

Add a New Row to a Pandas DataFrame

In [54]:
# As we dont know the last index and we want to add at the end of the data a new row
df.loc[len(df.index)] = ["Habib Ullah" , 26, "London", "England"]

In [55]:
df

            Name  Age     City     Country
0      Abu Bakar   25   Berlin     Germany
1          Bilal   22  Karachi    Pakistan
2         Hassan   17  Hamburg     Germany
3           Alex   32   Berlin     Germany
4  Mitchel Starc   35   Sydney  Austrailia
5    Habib Ullah   26   London     England

Remove Rows/Columns from a Pandas DataFrame

We can use drop() to delete rows and columns from a DataFrame.

In [56]:
drop = [1, "akdf", "Uzair", "me","as","ads"]
df["Deleted"] = drop

In [57]:
df

            Name  Age     City     Country Deleted
0      Abu Bakar   25   Berlin     Germany       1
1          Bilal   22  Karachi    Pakistan    akdf
2         Hassan   17  Hamburg     Germany   Uzair
3           Alex   32   Berlin     Germany      me
4  Mitchel Starc   35   Sydney  Austrailia      as
5    Habib Ullah   26   London     England     ads

In [58]:
df.loc[len(df.index)] = ["adsad", 1212, "Komka", "China", 121]

In [59]:
df

            Name   Age     City     Country Deleted
0      Abu Bakar    25   Berlin     Germany       1
1          Bilal    22  Karachi    Pakistan    akdf
2         Hassan    17  Hamburg     Germany   Uzair
3           Alex    32   Berlin     Germany      me
4  Mitchel Starc    35   Sydney  Austrailia      as
5    Habib Ullah    26   London     England     ads
6          adsad  1212    Komka       China     121

In [60]:
df.drop(6, axis=0, inplace= True)

In [61]:
df

            Name  Age     City     Country Deleted
0      Abu Bakar   25   Berlin     Germany       1
1          Bilal   22  Karachi    Pakistan    akdf
2         Hassan   17  Hamburg     Germany   Uzair
3           Alex   32   Berlin     Germany      me
4  Mitchel Starc   35   Sydney  Austrailia      as
5    Habib Ullah   26   London     England     ads

In [62]:
df.loc[len(df.index)] = ["adsad", 1212, "Komka", "China", 121]

In [63]:
df

            Name   Age     City     Country Deleted
0      Abu Bakar    25   Berlin     Germany       1
1          Bilal    22  Karachi    Pakistan    akdf
2         Hassan    17  Hamburg     Germany   Uzair
3           Alex    32   Berlin     Germany      me
4  Mitchel Starc    35   Sydney  Austrailia      as
5    Habib Ullah    26   London     England     ads
6          adsad  1212    Komka       China     121

In [64]:
df.loc[len(df.index)] = ["Tv$dsPad", 10012, "dsomka", "Germmmay", 1121]

In [65]:
df

            Name    Age     City     Country Deleted
0      Abu Bakar     25   Berlin     Germany       1
1          Bilal     22  Karachi    Pakistan    akdf
2         Hassan     17  Hamburg     Germany   Uzair
3           Alex     32   Berlin     Germany      me
4  Mitchel Starc     35   Sydney  Austrailia      as
5    Habib Ullah     26   London     England     ads
6          adsad   1212    Komka       China     121
7       Tv$dsPad  10012   dsomka    Germmmay    1121

In [66]:
df.drop([6,7], axis= 0, inplace= True)

In [67]:
df

            Name  Age     City     Country Deleted
0      Abu Bakar   25   Berlin     Germany       1
1          Bilal   22  Karachi    Pakistan    akdf
2         Hassan   17  Hamburg     Germany   Uzair
3           Alex   32   Berlin     Germany      me
4  Mitchel Starc   35   Sydney  Austrailia      as
5    Habib Ullah   26   London     England     ads

In [68]:
height = [180.1,179.8,170,178,186.3,181.2]

In [69]:
df["Height"] = height

In [70]:
df

            Name  Age     City     Country Deleted  Height
0      Abu Bakar   25   Berlin     Germany       1   180.1
1          Bilal   22  Karachi    Pakistan    akdf   179.8
2         Hassan   17  Hamburg     Germany   Uzair   170.0
3           Alex   32   Berlin     Germany      me   178.0
4  Mitchel Starc   35   Sydney  Austrailia      as   186.3
5    Habib Ullah   26   London     England     ads   181.2

In [71]:
maritalStatus = ["Married", "Single", "Single", "Single", "Married", "Divorced"]

In [72]:
df["MaritalStatus"] = maritalStatus

In [73]:
df

            Name  Age     City     Country Deleted  Height MaritalStatus
0      Abu Bakar   25   Berlin     Germany       1   180.1       Married
1          Bilal   22  Karachi    Pakistan    akdf   179.8        Single
2         Hassan   17  Hamburg     Germany   Uzair   170.0        Single
3           Alex   32   Berlin     Germany      me   178.0        Single
4  Mitchel Starc   35   Sydney  Austrailia      as   186.3       Married
5    Habib Ullah   26   London     England     ads   181.2      Divorced

In [74]:
df.drop('Deleted', axis=1, inplace= True)

In [75]:
df

            Name  Age     City     Country  Height MaritalStatus
0      Abu Bakar   25   Berlin     Germany   180.1       Married
1          Bilal   22  Karachi    Pakistan   179.8        Single
2         Hassan   17  Hamburg     Germany   170.0        Single
3           Alex   32   Berlin     Germany   178.0        Single
4  Mitchel Starc   35   Sydney  Austrailia   186.3       Married
5    Habib Ullah   26   London     England   181.2      Divorced

In [76]:
df.drop(["Height", "MaritalStatus"], axis=1, inplace= True)

In [77]:
df

            Name  Age     City     Country
0      Abu Bakar   25   Berlin     Germany
1          Bilal   22  Karachi    Pakistan
2         Hassan   17  Hamburg     Germany
3           Alex   32   Berlin     Germany
4  Mitchel Starc   35   Sydney  Austrailia
5    Habib Ullah   26   London     England

In [78]:
# df.drop(columns='Country', inplace=True)

Rename Labels in a DataFrame

We can rename columns in a Pandas DataFrame using the rename() function

In [79]:
maritalStatus = ["Married", "Single", "Single", "Single", "Married", "Divorced"]

In [80]:
df["Marital Status"] = maritalStatus

In [81]:
df

            Name  Age     City     Country Marital Status
0      Abu Bakar   25   Berlin     Germany        Married
1          Bilal   22  Karachi    Pakistan         Single
2         Hassan   17  Hamburg     Germany         Single
3           Alex   32   Berlin     Germany         Single
4  Mitchel Starc   35   Sydney  Austrailia        Married
5    Habib Ullah   26   London     England       Divorced

In [82]:
df.rename(index={0:"A"}, inplace= True)

In [83]:
df

            Name  Age     City     Country Marital Status
A      Abu Bakar   25   Berlin     Germany        Married
1          Bilal   22  Karachi    Pakistan         Single
2         Hassan   17  Hamburg     Germany         Single
3           Alex   32   Berlin     Germany         Single
4  Mitchel Starc   35   Sydney  Austrailia        Married
5    Habib Ullah   26   London     England       Divorced

In [84]:
df.reset_index(inplace= True)

In [85]:
df

  index           Name  Age     City     Country Marital Status
0     A      Abu Bakar   25   Berlin     Germany        Married
1     1          Bilal   22  Karachi    Pakistan         Single
2     2         Hassan   17  Hamburg     Germany         Single
3     3           Alex   32   Berlin     Germany         Single
4     4  Mitchel Starc   35   Sydney  Austrailia        Married
5     5    Habib Ullah   26   London     England       Divorced

In [88]:
df.drop(columns= "index",inplace= True)

In [89]:
df

            Name  Age     City     Country Marital Status
0      Abu Bakar   25   Berlin     Germany        Married
1          Bilal   22  Karachi    Pakistan         Single
2         Hassan   17  Hamburg     Germany         Single
3           Alex   32   Berlin     Germany         Single
4  Mitchel Starc   35   Sydney  Austrailia        Married
5    Habib Ullah   26   London     England       Divorced

In [90]:
df.rename(columns= {'Name': 'First Name'}, inplace = True)

In [91]:
df

      First Name  Age     City     Country Marital Status
0      Abu Bakar   25   Berlin     Germany        Married
1          Bilal   22  Karachi    Pakistan         Single
2         Hassan   17  Hamburg     Germany         Single
3           Alex   32   Berlin     Germany         Single
4  Mitchel Starc   35   Sydney  Austrailia        Married
5    Habib Ullah   26   London     England       Divorced

In [92]:
# rename columns multiple index labels
# df.rename(mapper={1: 10, 2: 100}, axis=0, inplace=True)